Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
#include "GSignalFlow.h"

#include "FpgaLink.h"
#include "GHardwareRandom.h"
#include "GMeasurementCalibration.h"
#include "SpectrumAnalyzer.h"
#include "GSerial.h"
#include "tjc_usart_hmi.h"
#include "stm32f4xx_hal.h"

#include <stdio.h>
#include <string.h>

#define G_FLOW_STATUS_POLL_MS       2U
#define G_FLOW_UART_TIMEOUT_MS      50U
#define G_FLOW_RESPONSE_LIMIT_MS    2000U
#define G_FLOW_ASCII_DEBUG_ENABLED   1U
#define G_FLOW_HMI_IDLE_REFRESH_MS  2000U
#define G_FLOW_HMI_BUSY_MIN_MS        300U
#define G_FLOW_CAPTURE_TIMEOUT_MS     2000U
#define G_FLOW_WAVE_HEIGHT_DIVISOR    3U
#define G_FLOW_WAVE_VERTICAL_OFFSET   20U
#define G_FLOW_WAVE_FALLBACK_POINTS   512U
#define G_FLOW_WAVE_MAX_POINTS        1024U
#define G_FLOW_SPECTRUM_VERTICAL_OFFSET 42U
#define G_FLOW_SPECTRUM_PEAK_VALUE      127U
#define G_FLOW_SPECTRUM_MIN_PEAK_HEIGHT 3U
#define G_FLOW_SPECTRUM_FALLBACK_POINTS 512U
#define G_FLOW_SPECTRUM_MAX_POINTS    1024U
#define G_FLOW_SPECTRUM_MIN_HZ        10000UL
#define G_FLOW_SPECTRUM_MAX_HZ        500000UL
#define G_FLOW_BUTTON_DEBOUNCE_MS     120U
#define G_FLOW_STREAM_INTERVAL_MS       0U
#define G_FLOW_STREAM_RETRY_MS        500U
#define G_FLOW_RAD_TO_DEG              57.29577951308232f
#define G_FLOW_VPP_RANDOM_MAX_MV        0.005f
#define G_FLOW_HF_MEDIAN_FRAMES            25U
#define G_FLOW_HF_MEDIAN_MIN_HZ       490000.0f
#define G_FLOW_HF_MEDIAN_MAX_PEAK_MV      30.0f
#define G_FLOW_HF_MEDIAN_FREQ_TOL_HZ    1000.0f

/*
 * 串口屏工程使用GB2312编码。这里使用固定字节串，避免编译器源文件编码
 * 影响屏幕上的中文显示。
 */
#define G_FLOW_HMI_FREQUENCY_GB2312 "\xC6\xB5\xC2\xCA"
#define G_FLOW_HMI_VPP_GB2312       "\xB7\xE5\xB7\xE5\xD6\xB5"
#define G_FLOW_HMI_RMS_GB2312       "\xD3\xD0\xD0\xA7\xD6\xB5"
#define G_FLOW_HMI_HARMONIC_GB2312  "\xD0\xB3\xB2\xA8"

typedef enum
{
    G_FLOW_STATE_IDLE = 0,
    G_FLOW_STATE_WAIT_ANALYSIS,
    G_FLOW_STATE_WAIT_WAVEFORM,
    G_FLOW_STATE_WAIT_RESTART,
    G_FLOW_STATE_HOLD
} GFlowState;

typedef enum
{
    G_FLOW_MODE_NONE = 0,
    G_FLOW_MODE_TIME,
    G_FLOW_MODE_FREQUENCY,
    G_FLOW_MODE_SERIAL_STREAM
} GFlowMeasurementMode;

static int16_t s_CaptureFrame[SPECTRUM_FRAME_LENGTH];
static int16_t s_WaveCaptureFrame[SPECTRUM_FRAME_LENGTH];
static SpectrumResult s_Result;
static GMeasurementResult s_Measurement;
static GMeasurementWaveform s_Waveform;
static GFlowState s_State;
static GFlowMeasurementMode s_ActiveMeasurementMode;
static GFlowMeasurementMode s_PendingHmiMode;
static uint32_t s_NextActionTick;
static uint32_t s_ReportSequence;
static uint32_t s_ActiveSequence;
static uint32_t s_CycleStartTick;
static uint32_t s_AnalysisElapsedMs;
static uint32_t s_FpgaId;
static uint32_t s_NextIdleHmiTextTick;
static uint8_t s_FpgaOnline;
static uint8_t s_SelectedWaveformCycles;
static uint8_t s_ActiveWaveformCycles;
static uint8_t s_CycleChangePending;
static uint8_t s_WaveFrameValid;
static uint8_t s_MeasurementEnabled;
static uint8_t s_HmiReadyPending;
static uint8_t s_SerialStreamEnabled;
static uint8_t s_HalfMvQuantizationEnabled;
static float s_TimeFundamentalHz;
static uint32_t s_HmiBusyUntilTick;
static uint32_t s_LastStartEventTick;
static uint32_t s_LastCycleEventTick;
static uint32_t s_LastFrequencyEventTick;
static uint32_t s_LastRangeEventTick;
static uint16_t s_WaveDisplayPoints;
static uint8_t s_WaveDisplay[G_FLOW_WAVE_MAX_POINTS];
static uint16_t s_SpectrumDisplayPoints;
static uint8_t s_SpectrumDisplay[G_FLOW_SPECTRUM_MAX_POINTS];
static GMeasurementResult s_HfMedianFrames[G_FLOW_HF_MEDIAN_FRAMES];
static uint8_t s_HfMedianActive;
static uint8_t s_HfMedianCount;
static uint32_t s_HfMedianStartTick;

static void GSignalFlow_SendText(const char *text);
static void GSignalFlow_SendStartup(void);
static void GSignalFlow_SendError(const char *stage);
static void GSignalFlow_SendNoSignal(void);
static void GSignalFlow_SendResult(void);
static uint8_t GSignalFlow_SendMeasurement(void);
static void GSignalFlow_SendCalibrationTelemetry(void);
static uint32_t GSignalFlow_RoundPositive(float value);
static void GSignalFlow_FormatFixed2(float value,
                                     char *buffer,
                                     size_t buffer_size);
static void GSignalFlow_FormatFixed3(float value,
                                     char *buffer,
                                     size_t buffer_size);
static void GSignalFlow_FormatFixed8(float value,
                                     char *buffer,
                                     size_t buffer_size);
static void GSignalFlow_FormatSignedFixed2(float value,
                                           char *buffer,
                                           size_t buffer_size);
static float GSignalFlow_PhaseSinDegrees(float phase_rad);
static float GSignalFlow_WrapSignedDegrees(float phase_deg);
static void GSignalFlow_StartOrRetry(uint32_t now);
static void GSignalFlow_FinishCycle(uint32_t now);
static void GSignalFlow_AbortCycle(const char *stage,
                                  const char *hmi_status);
static void GSignalFlow_HandleSerialCommand(void);
static void GSignalFlow_HandleCommand(void);
static void GSignalFlow_StartHmiMeasurement(GFlowMeasurementMode mode,
                                            uint32_t now);
static void GSignalFlow_ServicePendingHmiMeasurement(uint32_t now);
static void GSignalFlow_UpdateHmiPlaceholders(void);
static void GSignalFlow_UpdateHmiTimePlaceholders(void);
static void GSignalFlow_UpdateHmiFrequencyPlaceholders(void);
static void GSignalFlow_UpdateHmiTimeMeasurement(void);
static void GSignalFlow_UpdateHmiFrequencyMeasurement(void);
static void GSignalFlow_ServiceHmiMeasurement(void);
static void GSignalFlow_UpdateHmiMeasurementField(uint8_t field);
static void GSignalFlow_UpdateHmiNoSignal(void);
static uint8_t GSignalFlow_UpdateHmiSpectrum(uint8_t signal_valid);
static uint8_t GSignalFlow_BuildQualitativeSpectrum(uint16_t point_count);
static uint8_t GSignalFlow_UpdateHmiWaveform(void);
static uint8_t GSignalFlow_BuildAndDisplayWaveform(uint8_t cycles);
static uint8_t GSignalFlow_ShouldUseHfMedian(
    const GMeasurementResult *measurement);
static uint8_t GSignalFlow_HfMedianCompatible(
    const GMeasurementResult *measurement);
static void GSignalFlow_StoreHfMedianFrame(
    const GMeasurementResult *measurement);
static void GSignalFlow_FinalizeHfMedian(void);
static float GSignalFlow_Median25(const float *values);

void GSignalFlow_Init(void)
{
    memset(s_CaptureFrame, 0, sizeof(s_CaptureFrame));
    memset(s_WaveCaptureFrame, 0, sizeof(s_WaveCaptureFrame));
    memset(&s_Result, 0, sizeof(s_Result));
    memset(&s_Measurement, 0, sizeof(s_Measurement));
    memset(&s_Waveform, 0, sizeof(s_Waveform));
    memset(s_WaveDisplay, 0, sizeof(s_WaveDisplay));
    memset(s_SpectrumDisplay, 0, sizeof(s_SpectrumDisplay));
    memset(s_HfMedianFrames, 0, sizeof(s_HfMedianFrames));
    s_State = G_FLOW_STATE_IDLE;
    s_ActiveMeasurementMode = G_FLOW_MODE_NONE;
    s_PendingHmiMode = G_FLOW_MODE_NONE;
    s_NextActionTick = HAL_GetTick();
    s_ReportSequence = 0UL;
    s_ActiveSequence = 0UL;
    s_CycleStartTick = HAL_GetTick();
    s_AnalysisElapsedMs = 0UL;
    s_FpgaId = 0UL;
    s_NextIdleHmiTextTick = HAL_GetTick();
    s_SelectedWaveformCycles = 1U;
    s_ActiveWaveformCycles = 1U;
    s_CycleChangePending = 0U;
    s_WaveFrameValid = 0U;
    s_MeasurementEnabled = 0U;
    s_HmiReadyPending = 0U;
    s_SerialStreamEnabled = 0U;
    s_HalfMvQuantizationEnabled = 0U;
    s_TimeFundamentalHz = 0.0f;
    s_HmiBusyUntilTick = 0UL;
    s_LastStartEventTick = HAL_GetTick() - G_FLOW_BUTTON_DEBOUNCE_MS;
    s_LastCycleEventTick = HAL_GetTick() - G_FLOW_BUTTON_DEBOUNCE_MS;
    s_LastFrequencyEventTick = HAL_GetTick() - G_FLOW_BUTTON_DEBOUNCE_MS;
    s_LastRangeEventTick = HAL_GetTick() - G_FLOW_BUTTON_DEBOUNCE_MS;
    s_WaveDisplayPoints = 0U;
    s_SpectrumDisplayPoints = 0U;
    s_HfMedianActive = 0U;
    s_HfMedianCount = 0U;
    s_HfMedianStartTick = 0UL;

    /* 精密测量默认保留原生浮点幅值，不取整也不添加随机量。 */
    GHardwareRandom_Disable();

    TjcHmi_Init();

    FpgaLink_Init();
    s_FpgaOnline = Fpga_ReadId(&s_FpgaId);
    GSignalFlow_SendStartup();
    GSignalFlow_SendText(
        "G_STREAM,ready=1,auto=1,cmd=C:restart,S:stop,query=?\r\n");

