Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    /* 上电后直接连续采集，不需要按屏幕按钮或从USART1发送命令。 */
    s_SerialStreamEnabled = 1U;
    s_ActiveMeasurementMode = G_FLOW_MODE_SERIAL_STREAM;
    s_MeasurementEnabled = 1U;
    s_State = G_FLOW_STATE_WAIT_RESTART;
    s_NextActionTick = HAL_GetTick();
    GSignalFlow_SendText(
        "G_STREAM,state=running,mode=calibration,auto=1\r\n");
}

void GSignalFlow_Process(void)
{
    uint32_t now = HAL_GetTick();

    GSignalFlow_HandleSerialCommand();
    GSignalFlow_HandleCommand();
    GSignalFlow_ServicePendingHmiMeasurement(now);
    GSignalFlow_ServiceHmiMeasurement();

    if (s_State == G_FLOW_STATE_IDLE)
    {
        /*
         * 屏幕上电通常慢于MCU。首次测量前每2秒重发一次XXX占位文字，
         * 避免第一次命令发送过早后仍显示工程里的默认newtxt。
         */
        if ((int32_t)(now - s_NextIdleHmiTextTick) >= 0)
        {
            /* 兼容上一版可能遗留的ref_stop状态，确保屏幕继续刷新。 */
            tjc_send_string("ref_star");
            GSignalFlow_UpdateHmiPlaceholders();
            TjcHmi_SetComputeBusy(0U);
            /*
             * 屏幕启动时间不固定。未测量时只周期清空s1，不发送addt
             * 原始数据，避免屏幕尚未进入透明传输状态时画出随机杂波。
             */
            (void)GSignalFlow_UpdateHmiSpectrum(0U);
            s_NextIdleHmiTextTick = now + G_FLOW_HMI_IDLE_REFRESH_MS;
        }
        return;
    }

    /* 单次测量保持结果；串口连续模式在间隔到达后自动开始下一帧。 */
    if (s_State == G_FLOW_STATE_HOLD)
    {
        if ((s_SerialStreamEnabled != 0U) &&
            (s_ActiveMeasurementMode == G_FLOW_MODE_SERIAL_STREAM) &&
            ((int32_t)(now - s_NextActionTick) >= 0))
        {
            s_MeasurementEnabled = 1U;
            s_State = G_FLOW_STATE_WAIT_RESTART;
            s_NextActionTick = now;
        }
        return;
    }

    if ((int32_t)(now - s_NextActionTick) < 0)
    {
        return;
    }

    if (s_State == G_FLOW_STATE_WAIT_RESTART)
    {
        GSignalFlow_StartOrRetry(now);
        return;
    }

    {
        uint32_t status = 0UL;

        if (Fpga_ReadCaptureStatus(&status) == 0U)
        {
            GSignalFlow_AbortCycle("status", "STAT ERR");
            return;
        }

        if ((status & FPGA_CAPTURE_STATUS_DONE) == 0UL)
        {
            if ((uint32_t)(now - s_CycleStartTick) >=
                G_FLOW_CAPTURE_TIMEOUT_MS)
            {
                GSignalFlow_AbortCycle("timeout", "TIMEOUT");
                return;
            }
            s_NextActionTick = now + G_FLOW_STATUS_POLL_MS;
            return;
        }

        if ((uint16_t)(status >> 16U) != FPGA_CAPTURE_FRAME_LENGTH)
        {
            GSignalFlow_AbortCycle("length", "LEN ERR");
            return;
        }
    }

    if (Fpga_ReadCaptureFrame(
            (s_State == G_FLOW_STATE_WAIT_WAVEFORM)
                ? s_WaveCaptureFrame : s_CaptureFrame,
            SPECTRUM_FRAME_LENGTH) == 0U)
    {
        GSignalFlow_AbortCycle("frame", "FRAME ERR");
        return;
    }

    if (s_State == G_FLOW_STATE_WAIT_ANALYSIS)
    {
        uint8_t use_hf_median;

        if (SpectrumAnalyzer_Run(s_CaptureFrame, &s_Result) == 0U)
        {
            if (s_Result.status == SPECTRUM_STATUS_NO_SIGNAL)
            {
                s_ActiveSequence = s_ReportSequence;
                s_ReportSequence++;
                s_AnalysisElapsedMs = HAL_GetTick() - s_CycleStartTick;
                GSignalFlow_SendNoSignal();
                if (s_ActiveMeasurementMode != G_FLOW_MODE_SERIAL_STREAM)
                {
                    GSignalFlow_UpdateHmiNoSignal();
                }
            }
            else
            {
                GSignalFlow_AbortCycle("spectrum", "CALC ERR");
                return;
            }
            GSignalFlow_FinishCycle(HAL_GetTick());
            return;
        }

        if (GMeasurement_Convert(&s_Result,
                                 GMeasurementCalibration_Get(),
                                 &s_Measurement) == 0U)
        {
            GSignalFlow_AbortCycle("measurement", "CALC ERR");
            return;
        }

        use_hf_median =
            ((s_ActiveMeasurementMode != G_FLOW_MODE_SERIAL_STREAM) &&
             ((s_HfMedianActive != 0U) ||
              (GSignalFlow_ShouldUseHfMedian(&s_Measurement) != 0U)))
                ? 1U : 0U;

        if (use_hf_median != 0U)
        {
            if ((s_HfMedianActive == 0U) ||
                (GSignalFlow_HfMedianCompatible(&s_Measurement) == 0U))
            {
                s_HfMedianActive = 1U;
                s_HfMedianCount = 0U;
                s_HfMedianStartTick = s_CycleStartTick;
            }

            GSignalFlow_StoreHfMedianFrame(&s_Measurement);
            if (s_HfMedianCount < G_FLOW_HF_MEDIAN_FRAMES)
            {
                if (Fpga_StartCapture(0U) == 0U)
                {
                    GSignalFlow_AbortCycle("average_start", "AVG ERR");
                    return;
                }
                s_CycleStartTick = HAL_GetTick();
                s_State = G_FLOW_STATE_WAIT_ANALYSIS;
                s_NextActionTick =
                    s_CycleStartTick + G_FLOW_STATUS_POLL_MS;
                return;
            }

            GSignalFlow_FinalizeHfMedian();
        }

        s_ActiveSequence = s_ReportSequence;
        s_ReportSequence++;
        s_AnalysisElapsedMs =
            (use_hf_median != 0U)
                ? (HAL_GetTick() - s_HfMedianStartTick)
                : (HAL_GetTick() - s_CycleStartTick);
        GSignalFlow_SendResult();
        if (GSignalFlow_SendMeasurement() == 0U)
        {
            GSignalFlow_AbortCycle("measurement", "CALC ERR");
            return;
        }
        GSignalFlow_SendCalibrationTelemetry();

        if (s_ActiveMeasurementMode == G_FLOW_MODE_SERIAL_STREAM)
        {
            GSignalFlow_FinishCycle(HAL_GetTick());
            return;
        }

        if (s_ActiveMeasurementMode == G_FLOW_MODE_FREQUENCY)
        {
            GSignalFlow_UpdateHmiFrequencyMeasurement();
            (void)GSignalFlow_UpdateHmiSpectrum(1U);
            GSignalFlow_FinishCycle(HAL_GetTick());
            return;
        }

        GSignalFlow_UpdateHmiTimeMeasurement();
        s_TimeFundamentalHz = s_Result.fundamental_hz;

        if (Fpga_StartCapture(1U) == 0U)
        {
            GSignalFlow_AbortCycle("wave_start", "WAVE ERR");
            return;
        }

        s_State = G_FLOW_STATE_WAIT_WAVEFORM;
        s_NextActionTick = HAL_GetTick() + G_FLOW_STATUS_POLL_MS;
        return;
    }

    if (s_State == G_FLOW_STATE_WAIT_WAVEFORM)
    {
        if (s_CycleChangePending != 0U)
        {
            s_ActiveWaveformCycles = s_SelectedWaveformCycles;
            s_CycleChangePending = 0U;
        }

        if (GSignalFlow_BuildAndDisplayWaveform(
                s_ActiveWaveformCycles) == 0U)
        {
            GSignalFlow_AbortCycle("waveform", "WAVE ERR");
            return;
        }

        s_WaveFrameValid = 1U;
        GSignalFlow_FinishCycle(HAL_GetTick());
        return;
    }
}

