Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    for (component = 0U;
         (component < s_Result.component_count) &&
         ((size_t)written < sizeof(buffer));
         component++)
    {
        const SpectrumComponent *raw = &s_Result.components[component];
        float phase_deg =
            GSignalFlow_PhaseSinDegrees(raw->phase_rad);
        float relative_deg = (reference_valid != 0U)
            ? GSignalFlow_WrapSignedDegrees(
                phase_deg -
                (float)raw->harmonic * reference_phase_deg)
            : 0.0f;
        char phase_text[20];
        char relative_text[20];
        int appended;

        GSignalFlow_FormatFixed2(phase_deg,
                                 phase_text,
                                 sizeof(phase_text));
        GSignalFlow_FormatSignedFixed2(relative_deg,
                                       relative_text,
                                       sizeof(relative_text));
        appended = snprintf(&buffer[written],
                            sizeof(buffer) - (size_t)written,
                            ",h%u=%sdeg:rel=%sdeg",
                            (unsigned int)raw->harmonic,
                            phase_text,
                            relative_text);
        if (appended < 0)
        {
            break;
        }
        if ((size_t)appended >= sizeof(buffer) - (size_t)written)
        {
            written = (int)(sizeof(buffer) - 1U);
            break;
        }
        written += appended;
    }

    if ((size_t)written + 2U < sizeof(buffer))
    {
        buffer[written++] = '\r';
        buffer[written++] = '\n';
        buffer[written] = '\0';
    }
    else
    {
        buffer[sizeof(buffer) - 3U] = '\r';
        buffer[sizeof(buffer) - 2U] = '\n';
        buffer[sizeof(buffer) - 1U] = '\0';
    }
    GSignalFlow_SendText(buffer);

    for (component = 0U;
         (component < s_Result.component_count) &&
         (component < s_Measurement.component_count);
         component++)
    {
        const SpectrumComponent *raw = &s_Result.components[component];
        const GMeasurementComponent *converted =
            &s_Measurement.components[component];
        float phase_deg =
            GSignalFlow_PhaseSinDegrees(raw->phase_rad);
        float relative_deg = (reference_valid != 0U)
            ? GSignalFlow_WrapSignedDegrees(
                phase_deg -
                (float)raw->harmonic * reference_phase_deg)
            : 0.0f;
        float mv_per_code = 0.0f;
        char frequency_text[24];
        char codes_text[24];
        char scale_text[24];
        char amplitude_text[24];
        char phase_text[20];
        char relative_text[20];

        if (raw->amplitude_codes > 0.0f)
        {
            mv_per_code = converted->amplitude_mv /
                          raw->amplitude_codes;
#if G_MEASUREMENT_ENABLE_50_OHM_SCALE
            mv_per_code /= G_MEASUREMENT_50_OHM_AMPLITUDE_SCALE;
#endif
        }

        GSignalFlow_FormatFixed2(raw->frequency_hz,
                                 frequency_text,
                                 sizeof(frequency_text));
        GSignalFlow_FormatFixed3(raw->amplitude_codes,
                                 codes_text,
                                 sizeof(codes_text));
        GSignalFlow_FormatFixed8(mv_per_code,
                                 scale_text,
                                 sizeof(scale_text));
        GSignalFlow_FormatFixed3(converted->amplitude_mv,
                                 amplitude_text,
                                 sizeof(amplitude_text));
        GSignalFlow_FormatFixed2(phase_deg,
                                 phase_text,
                                 sizeof(phase_text));
        GSignalFlow_FormatSignedFixed2(relative_deg,
                                       relative_text,
                                       sizeof(relative_text));

        (void)snprintf(
            buffer,
            sizeof(buffer),
            "G_COMP,seq=%lu,h=%u,f=%sHz,codes=%s,k=%smV/code,amp=%smV,phase_sin=%sdeg,rel=%sdeg\r\n",
            (unsigned long)s_ActiveSequence,
            (unsigned int)raw->harmonic,
            frequency_text,
            codes_text,
            scale_text,
            amplitude_text,
            phase_text,
            relative_text);
        GSignalFlow_SendText(buffer);
    }
}

static void GSignalFlow_UpdateHmiTimeMeasurement(void)
{
    GSignalFlow_UpdateHmiMeasurementField(0U);
    GSignalFlow_UpdateHmiMeasurementField(1U);
    GSignalFlow_UpdateHmiMeasurementField(2U);
}

static void GSignalFlow_UpdateHmiFrequencyMeasurement(void)
{
    GSignalFlow_UpdateHmiMeasurementField(3U);
    GSignalFlow_UpdateHmiMeasurementField(4U);
    GSignalFlow_UpdateHmiMeasurementField(5U);
}

static void GSignalFlow_ServiceHmiMeasurement(void)
{
    if ((s_HmiReadyPending != 0U) &&
        ((int32_t)(HAL_GetTick() - s_HmiBusyUntilTick) >= 0))
    {
        TjcHmi_SetComputeBusy(0U);
        s_HmiReadyPending = 0U;
    }
}

static void GSignalFlow_UpdateHmiMeasurementField(uint8_t field)
{
    char text[64];
    char value_text[24];
    const char *object_name;

    if (field == 0U)
    {
        (void)snprintf(text,
                       sizeof(text),
                       G_FLOW_HMI_FREQUENCY_GB2312 "F\xA3\xBA%luHz",
                       (unsigned long)GSignalFlow_RoundPositive(
                           s_Measurement.fundamental_hz));
        tjc_send_txt("t0", "txt", text);
        return;
    }
    if (field == 1U)
    {
        GSignalFlow_FormatFixed3(s_Measurement.upp_mv,
                                 value_text,
                                 sizeof(value_text));
        (void)snprintf(text,
                       sizeof(text),
                       G_FLOW_HMI_VPP_GB2312 "Vpp\xA3\xBA%smV",
                       value_text);
        tjc_send_txt("t1", "txt", text);
        return;
    }
    if (field == 2U)
    {
        GSignalFlow_FormatFixed3(s_Measurement.urms_mv,
                                 value_text,
                                 sizeof(value_text));
        (void)snprintf(text,
                       sizeof(text),
                       G_FLOW_HMI_RMS_GB2312 "Vrms\xA3\xBA%smV",
                       value_text);
        tjc_send_txt("t2", "txt", text);
        return;
    }

